app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"  ORDER BY "employees"."age" ASC
---
  def order_by_age
	@employees = Employee.order(:age)

SELECT "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC
---
  def order_by_salary
     @employees=Employee.order(:salary)

SELECT "employees".* FROM "employees" WHERE (age>65)
---
  def order_by_retirment
     @employees=Employee.where('age>?', 65)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 1
---
  def highest_salary
     @employees=Employee.order(salary: :desc).limit(1)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."age" DESC LIMIT 5
---
  def highage_5employees
     @employees=Employee.order(age: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" DESC LIMIT 5
---
  def highsal_5employees
    @employees=Employee.order(salary: :desc).limit(5)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."age" DESC LIMIT 1
---
   def lowsal_highage
    @employees=Employee.order(salary: :asc).limit(1)
	@employees=Employee.order(age: :desc).limit(1)

SELECT  "employees".* FROM "employees"  ORDER BY "employees"."salary" ASC LIMIT 1
---
  def low_highsal
    @employees=Employee.order(salary: :desc).limit(1)

INSERT INTO "employees" ("name", "email", "age", "salary", "integer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "pawan"], ["email", "pawan@gmail.com"], ["age", 43], ["salary", "34000"], ["integer", ""], ["created_at", "2017-03-19 05:57:10.508909"], ["updated_at", "2017-03-19 05:57:10.508909"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "email" = ?, "age" = ?, "salary" = ?, "integer" = ?, "department_id" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["email", "hugh@gmail.com"], ["age", 43], ["salary", "80000"], ["integer", "27"], ["department_id", 4], ["updated_at", "2017-03-19 06:07:47.510457"], ["id", 28]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)